[
  {
    "id": 1,
    "task": "Using server, username, and password details provided to you, connect to your assigned server using ssh.",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "Done"
  },
  {
    "id": 2,
    "task": "Create a new user account as the username of your choice",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "Done"
  },
  {
    "id": 3,
    "task": "Login as that new user",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "Done"
  },
  {
    "id": 4,
    "task": "In your home directory, create a new directory called “memories”. Inside of it, create a text file which describes your favorite memory. Set the file access to full permissions for all the system (777).",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "Done"
  },
  {
    "id": 5,
    "task": "Create a shell script which does the following:",
    "subtask": [
      {
        "a": "Makes a copy of your memories file, naming it “privatemems”",
        "b": "Sets permissions of the new file to 755",
        "c": "Appends to the file the current system time"
      }
    ],
    "status": "Done"
  },
  {
    "id": 6,
    "task": "Create a local git repository",
    "subtask": [
      {
        "a": "You may do this either starting locally and pushing to an origin (online) location of your choice, or you may create it online first and clone it to your home directory"
      }
    ],
    "status": "Done"
  },
  {
    "id": 7,
    "task": "Using the language you are most comfortable with, create an HTTPS (you’ll need to generate a keypair) server application with the following interfaces (very basic html/JS copied from internet for testing is completely fine here. Just cite your sources):",
    "subtask": [
      {
        "stepID": 7.1,
        "name": "Key-value server",
        "tasks": [
          {
            "i": "POST request handler where a user may specify a value to be stored under a key",
            "ii": "POST request handler where a user may request the value for a key",
            "iii": "POST request handler where a user may request all the current contents of the key-value structure",
            "iv": "POST request handler where a user may delete a key-value pair",
            "v": "POST request handler where a user may clear then entire key-value structure"
          }
        ]
      },
      {
        "stepID": 7.2,
        "name": "File upload server:",
        "tasks": [
          {
            "i": "Request handler where a user may upload a file",
            "ii": "GET request handler where a user may request a list (text or html) of uploaded files",
            "iii": "GET request handler where a user may request a specific file for download"
          }
        ]
      }
    ],
    "status": "In Progress"
  },
  {
    "id": 8,
    "task": "Make sure to regularly commit changes in your local repo while developing and push those changes to your online repository.",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "In Progress"
  },
  {
    "id": 9,
    "task": "Once application is working, containerize it:",
    "subtask": [
      {
        "a": "Install docker on your provided server",
        "b": "Create a Dockerfile using the ubuntu image (https://hub.docker.com/_/ubuntu)",
        "c": "Start and test that your server runs and is accessible from outside the container",
        "d": "Set your container to start if system reboots"
      }
    ],
    "status": "Not Started"
  },
  {
    "id": 10,
    "task": "Commit and push Dockerfile in your repository",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "Not Started"
  },
  {
    "id": 11,
    "task": "Email/call/message me.",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "Not Started"
  },
  {
    "id": 12,
    "task": "Configure system’s firewall to only allow SSH and HTTPS connections",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "Not Started"
  },
  {
    "id": 13,
    "task": "Get a free domain name for the host ( https://www.noip.com/ is an option)",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "Done"
  },
  {
    "id": 14,
    "task": "Get a LetsEncrypt SSL certificate for your server so that it stops complaining about your unsigned certificate (requires a domain name)",
    "subtask": [
      {
        "": ""
      }
    ],
    "status": "In Progress"
  }
]
